data/executions/2026-07-21T00-54-12.036927326Z-738bc07d/execution.log
[CONTROL] Iniciando bci.cards.simulation.PublicJsonPlaceholderPostSmokeSimulation
Picked up JAVA_TOOL_OPTIONS: -XX:+UseG1GC -Xms32m -Xmx384m -XX:MaxMetaspaceSize=192m
To honour the JVM settings for this build a single-use Daemon process will be forked. For more on this, please refer to https://docs.gradle.org/8.6/userguide/gradle_daemon.html#sec:disabling_the_daemon in the Gradle documentation.
Daemon will be stopped at the end of the build 
> Task :compileGatlingJava NO-SOURCE

> Task :compileGatlingScala
Picked up JAVA_TOOL_OPTIONS: -XX:+UseG1GC -Xms32m -Xmx384m -XX:MaxMetaspaceSize=192m

> Task :processGatlingResources NO-SOURCE
> Task :gatlingClasses

> Task :gatlingRun
Picked up JAVA_TOOL_OPTIONS: -XX:+UseG1GC -Xms32m -Xmx384m -XX:MaxMetaspaceSize=192m
00:54:34.316 [main] INFO io.gatling.core.config.GatlingConfiguration$ -- Gatling will try to load 'gatling.conf' config file as ClassLoader resource.
00:54:34.384 [main] DEBUG io.netty.util.internal.logging.InternalLoggerFactory -- Using SLF4J as the default logging framework
00:54:34.387 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- Java version: 17
00:54:34.387 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- -Dio.netty.noUnsafe: false
00:54:34.387 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- Thread.isVirtual() is not available: 
00:54:34.388 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- sun.misc.Unsafe.theUnsafe: available
00:54:34.389 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- sun.misc.Unsafe base methods: all available
00:54:34.389 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- java.nio.Buffer.address: available
00:54:34.389 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- direct buffer constructor: unavailable: Reflective setAccessible(true) disabled
00:54:34.390 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- java.nio.Bits.unaligned: available, true
00:54:34.391 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- jdk.internal.misc.Unsafe.allocateUninitializedArray(int): available
00:54:34.392 [main] DEBUG io.netty.util.internal.PlatformDependent0 -- java.nio.DirectByteBuffer.<init>(long, {int,long}): unavailable
00:54:34.393 [main] DEBUG io.netty.util.internal.PlatformDependent -- sun.misc.Unsafe: available
00:54:34.393 [main] DEBUG io.netty.util.internal.PlatformDependent -- -Dio.netty.tmpdir: /tmp (java.io.tmpdir)
00:54:34.393 [main] DEBUG io.netty.util.internal.PlatformDependent -- -Dio.netty.bitMode: 64 (sun.arch.data.model)
00:54:34.393 [main] DEBUG io.netty.util.internal.PlatformDependent -- -Dio.netty.maxDirectMemory: 1073741824 bytes
00:54:34.394 [main] DEBUG io.netty.util.internal.CleanerJava9 -- java.nio.ByteBuffer.cleaner(): available
00:54:34.394 [main] DEBUG io.netty.util.internal.PlatformDependent -- -Dio.netty.noPreferDirect: false
00:54:34.394 [main] DEBUG io.netty.util.internal.PlatformDependent -- -Dio.netty.ignoreExpensiveClean: false
00:54:34.401 [main] DEBUG io.netty.util.internal.PlatformDependent -- -Dio.netty.jfr.enabled: true
00:54:34.403 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- -Dio.netty.native.workdir: /tmp (io.netty.tmpdir)
00:54:34.403 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- -Dio.netty.native.deleteLibAfterLoading: true
00:54:34.403 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- -Dio.netty.native.tryPatchShadedId: true
00:54:34.403 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- -Dio.netty.native.detectNativeLibraryDuplicates: true
00:54:34.436 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- Successfully loaded the library /tmp/libnetty_tcnative_linux_x86_643310040169948520977.so
00:54:34.436 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- Loaded library with name 'netty_tcnative_linux_x86_64'
00:54:34.436 [main] DEBUG io.netty.handler.ssl.OpenSsl -- Initialize netty-tcnative using engine: 'default'
00:54:34.436 [main] DEBUG io.netty.handler.ssl.OpenSsl -- netty-tcnative using native library: BoringSSL
00:54:34.515 [main] DEBUG io.netty.util.ResourceLeakDetector -- -Dio.netty.leakDetection.level: simple
00:54:34.515 [main] DEBUG io.netty.util.ResourceLeakDetector -- -Dio.netty.leakDetection.targetRecords: 4
00:54:34.520 [main] DEBUG io.netty.buffer.AbstractByteBuf -- -Dio.netty.buffer.checkAccessible: true
00:54:34.520 [main] DEBUG io.netty.buffer.AbstractByteBuf -- -Dio.netty.buffer.checkBounds: true
00:54:34.520 [main] DEBUG io.netty.util.ResourceLeakDetectorFactory -- Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@31ea9581
00:54:34.534 [main] DEBUG io.netty.util.internal.InternalThreadLocalMap -- -Dio.netty.threadLocalMap.stringBuilder.initialSize: 1024
00:54:34.535 [main] DEBUG io.netty.util.internal.InternalThreadLocalMap -- -Dio.netty.threadLocalMap.stringBuilder.maxSize: 4096
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.numHeapArenas: 24
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.numDirectArenas: 24
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.pageSize: 8192
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.maxOrder: 9
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.chunkSize: 4194304
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.smallCacheSize: 256
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.normalCacheSize: 64
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.maxCachedBufferCapacity: 32768
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.cacheTrimInterval: 8192
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.cacheTrimIntervalMillis: 0
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.useCacheForAllThreads: false
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.maxCachedByteBuffersPerChunk: 1023
00:54:34.536 [main] DEBUG io.netty.buffer.PooledByteBufAllocator -- -Dio.netty.allocator.disableCacheFinalizersForFastThreadLocalThreads: false
00:54:34.541 [main] DEBUG io.netty.buffer.ByteBufUtil -- -Dio.netty.allocator.type: pooled
00:54:34.541 [main] DEBUG io.netty.buffer.ByteBufUtil -- -Dio.netty.threadLocalDirectBufferSize: 0
00:54:34.541 [main] DEBUG io.netty.buffer.ByteBufUtil -- -Dio.netty.maxThreadLocalCharBufferSize: 200000
00:54:34.543 [main] DEBUG io.netty.util.ResourceLeakDetectorFactory -- Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@14bdbc74
00:54:34.547 [main] DEBUG io.netty.util.Recycler -- -Dio.netty.recycler.maxCapacityPerThread: 4096
00:54:34.547 [main] DEBUG io.netty.util.Recycler -- -Dio.netty.recycler.ratio: 8
00:54:34.547 [main] DEBUG io.netty.util.Recycler -- -Dio.netty.recycler.chunkSize: 32
00:54:34.547 [main] DEBUG io.netty.util.Recycler -- -Dio.netty.recycler.blocking: false
00:54:34.547 [main] DEBUG io.netty.util.Recycler -- -Dio.netty.recycler.batchFastThreadLocalOnly: true
00:54:34.616 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256 => ECDHE-ECDSA-AES128-GCM-SHA256
00:54:34.616 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256 => ECDHE-ECDSA-AES128-GCM-SHA256
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256 => ECDHE-RSA-AES128-GCM-SHA256
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_RSA_WITH_AES_128_GCM_SHA256 => ECDHE-RSA-AES128-GCM-SHA256
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384 => ECDHE-ECDSA-AES256-GCM-SHA384
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384 => ECDHE-ECDSA-AES256-GCM-SHA384
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384 => ECDHE-RSA-AES256-GCM-SHA384
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_RSA_WITH_AES_256_GCM_SHA384 => ECDHE-RSA-AES256-GCM-SHA384
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256 => ECDHE-ECDSA-CHACHA20-POLY1305
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_ECDSA_WITH_CHACHA20_POLY1305_SHA256 => ECDHE-ECDSA-CHACHA20-POLY1305
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256 => ECDHE-RSA-CHACHA20-POLY1305
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_RSA_WITH_CHACHA20_POLY1305_SHA256 => ECDHE-RSA-CHACHA20-POLY1305
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_PSK_WITH_CHACHA20_POLY1305_SHA256 => ECDHE-PSK-CHACHA20-POLY1305
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_PSK_WITH_CHACHA20_POLY1305_SHA256 => ECDHE-PSK-CHACHA20-POLY1305
00:54:34.617 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_ECDSA_WITH_AES_128_CBC_SHA => ECDHE-ECDSA-AES128-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_ECDSA_WITH_AES_128_CBC_SHA => ECDHE-ECDSA-AES128-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA => ECDHE-RSA-AES128-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_RSA_WITH_AES_128_CBC_SHA => ECDHE-RSA-AES128-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_PSK_WITH_AES_128_CBC_SHA => ECDHE-PSK-AES128-CBC-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_PSK_WITH_AES_128_CBC_SHA => ECDHE-PSK-AES128-CBC-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_ECDSA_WITH_AES_256_CBC_SHA => ECDHE-ECDSA-AES256-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_ECDSA_WITH_AES_256_CBC_SHA => ECDHE-ECDSA-AES256-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA => ECDHE-RSA-AES256-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_RSA_WITH_AES_256_CBC_SHA => ECDHE-RSA-AES256-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_ECDHE_PSK_WITH_AES_256_CBC_SHA => ECDHE-PSK-AES256-CBC-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_ECDHE_PSK_WITH_AES_256_CBC_SHA => ECDHE-PSK-AES256-CBC-SHA
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_RSA_WITH_AES_128_GCM_SHA256 => AES128-GCM-SHA256
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_RSA_WITH_AES_128_GCM_SHA256 => AES128-GCM-SHA256
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_RSA_WITH_AES_256_GCM_SHA384 => AES256-GCM-SHA384
00:54:34.618 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_RSA_WITH_AES_256_GCM_SHA384 => AES256-GCM-SHA384
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_RSA_WITH_AES_128_CBC_SHA => AES128-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_RSA_WITH_AES_128_CBC_SHA => AES128-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_PSK_WITH_AES_128_CBC_SHA => PSK-AES128-CBC-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_PSK_WITH_AES_128_CBC_SHA => PSK-AES128-CBC-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_RSA_WITH_AES_256_CBC_SHA => AES256-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_RSA_WITH_AES_256_CBC_SHA => AES256-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: TLS_PSK_WITH_AES_256_CBC_SHA => PSK-AES256-CBC-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.CipherSuiteConverter -- Cipher suite mapping: SSL_PSK_WITH_AES_256_CBC_SHA => PSK-AES256-CBC-SHA
00:54:34.619 [main] DEBUG io.netty.handler.ssl.OpenSsl -- Supported protocols (OpenSSL): [SSLv2Hello, TLSv1, TLSv1.1, TLSv1.2, TLSv1.3] 
00:54:34.619 [main] DEBUG io.netty.handler.ssl.OpenSsl -- Default cipher suites (OpenSSL): [TLS_ECDHE_ECDSA_WITH_AES_256_GCM_SHA384, TLS_ECDHE_ECDSA_WITH_AES_128_GCM_SHA256, TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256, TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384, TLS_ECDHE_RSA_WITH_AES_128_CBC_SHA, TLS_ECDHE_RSA_WITH_AES_256_CBC_SHA, TLS_RSA_WITH_AES_128_GCM_SHA256, TLS_RSA_WITH_AES_128_CBC_SHA, TLS_RSA_WITH_AES_256_CBC_SHA, TLS_AES_128_GCM_SHA256, TLS_AES_256_GCM_SHA384, TLS_AES_128_GCM_SHA256, TLS_AES_256_GCM_SHA384, TLS_AES_128_GCM_SHA256, TLS_AES_256_GCM_SHA384, TLS_CHACHA20_POLY1305_SHA256]
00:54:34.665 [main] DEBUG io.netty.util.internal.NativeLibraryLoader -- Successfully loaded the library /tmp/libnetty_transport_native_epoll_x86_644285266872791720441.so
00:54:34.667 [main] DEBUG io.netty.util.NetUtil -- -Djava.net.preferIPv4Stack: false
00:54:34.667 [main] DEBUG io.netty.util.NetUtil -- -Djava.net.preferIPv6Addresses: false
00:54:34.668 [main] DEBUG io.netty.util.NetUtilInitializations -- Loopback interface: lo (lo, 0:0:0:0:0:0:0:1%lo)
00:54:34.669 [main] DEBUG io.netty.util.NetUtil -- /proc/sys/net/core/somaxconn: 4096
00:54:34.672 [main] DEBUG io.netty.channel.MultithreadEventLoopGroup -- -Dio.netty.eventLoopThreads: 24
00:54:34.675 [main] DEBUG io.netty.util.concurrent.GlobalEventExecutor -- -Dio.netty.globalEventExecutor.quietPeriodSeconds: 1
00:54:34.680 [main] DEBUG io.netty.util.internal.PlatformDependent -- org.jctools-core.MpscChunkedArrayQueue: available
Jul 21, 2026 12:54:34 AM java.util.prefs.FileSystemPreferences$1 run
INFO: Created user preferences directory.
00:54:35.737 [main] DEBUG io.gatling.http.engine.HttpEngine -- Start warm up
00:54:35.784 [gatling-1-1] DEBUG io.gatling.http.client.pool.ChannelPool -- No channel in the pool for key ChannelPoolKey{clientId=0, remoteKey=RemoteKey{targetHostBaseUrl='https://gatling.io', proxyHost='null', proxyPort=0}}
00:54:35.812 [gatling-1-1] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- Opening new channel to remote=[gatling.io/198.202.211.1:443] from local=null
00:54:35.816 [gatling-1-1] DEBUG io.netty.channel.DefaultChannelId -- -Dio.netty.processId: 365 (auto-detected)
00:54:35.817 [gatling-1-1] DEBUG io.netty.channel.DefaultChannelId -- -Dio.netty.machineId: 02:42:ac:ff:fe:17:00:02 (auto-detected)
00:54:35.830 [gatling-1-1] DEBUG io.netty.bootstrap.ChannelInitializerExtensions -- -Dio.netty.bootstrap.extensions: null
00:54:35.851 [gatling-1-1] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- Connected to remoteAddress=gatling.io/198.202.211.1:443 from localAddress=/172.23.0.2:41832
00:54:35.851 [gatling-1-1] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- Installing SslHandler for gatling.io:443
00:54:35.860 [gatling-1-1] DEBUG io.netty.util.ResourceLeakDetectorFactory -- Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@6e0dc0ca
00:54:35.893 [gatling-1-1] DEBUG io.netty.handler.ssl.util.InsecureTrustManagerFactory -- Accepting a server certificate: CN=gatling.io
00:54:35.894 [gatling-1-1] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- TLS handshake successful: peerHost=gatling.io peerPort=443 protocol=TLSv1.3 cipher suite=TLS_AES_128_GCM_SHA256
00:54:35.896 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Write request WritableRequest{request=DefaultFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: EmptyByteBufBE)
GET / HTTP/1.1
accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
accept-language: en-US,en;q=0.5
accept-encoding: gzip
connection: close
user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:109.0) Gecko/20100101 Firefox/119.0
host: gatling.io, content=null}
00:54:35.902 [gatling-1-1] DEBUG io.netty.handler.ssl.SslHandler -- [id: 0xe1653cac, L:/172.23.0.2:41832 - R:gatling.io/198.202.211.1:443] HANDSHAKEN: protocol:TLSv1.3 cipher suite:TLS_AES_128_GCM_SHA256
00:54:35.929 [gatling-1-1] DEBUG io.netty.util.ResourceLeakDetectorFactory -- Loaded default ResourceLeakDetector: io.netty.util.ResourceLeakDetector@574bae84
00:54:35.936 [gatling-1-1] DEBUG io.netty.handler.codec.compression.ZlibCodecFactory -- -Dio.netty.noJdkZlibDecoder: false
00:54:35.937 [gatling-1-1] DEBUG io.netty.handler.codec.compression.ZlibCodecFactory -- -Dio.netty.noJdkZlibEncoder: false
00:54:35.937 [gatling-1-1] DEBUG io.netty.handler.codec.compression.ZlibCodecFactory -- JZlib not in the classpath; the only window bits supported value will be 15
00:54:35.940 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpResponse(decodeResult: success, version: HTTP/1.1)
HTTP/1.1 200 OK
Date: Tue, 21 Jul 2026 00:54:35 GMT
Content-Type: text/html; charset=utf-8
Transfer-Encoding: chunked
Connection: close
set-cookie: _cfuvid=_ujIp.MXEDRIrB9OAk7oldALXfwkalNBPY3uN6XeJoM-1784595275.8394997-1.0.1.1-NlCjUehJpjgmlrxgPPozj3ZkU9K5ik_guB.T1.9nJ3I; HttpOnly; SameSite=None; Secure; Path=/; Domain=gatling.io
CF-Ray: a1e63c39f934ddba-SCL
CF-Cache-Status: HIT
Age: 29261
Last-Modified: Mon, 20 Jul 2026 19:58:11 GMT
Link: <https://cdn.prod.website-files.com>; rel=preconnect; crossorigin, <https://cdn.prod.website-files.com/685a8fe4ddca049f26333871/css/gatling-preview.webflow.shared.c41c97f2d.min.css>; rel=preload; as=style; crossorigin; integrity="sha384-xByX8t1htdGii3tmnP5xk5sDBadRR3vk/u1aWBru0RxqtuKA4ytZHRkAh12JqLPz"
Server: cloudflare
Strict-Transport-Security: max-age=31536000
Vary: accept-encoding
surrogate-control: max-age=432000
surrogate-key: gatling.io 685a8fe4ddca049f26333871 pageId:685a8fe4ddca049f26333870 685bbddcda38f942f0e21505 6878c637117d8e2326e74ab7 68809670a5aa1db64a23658c 685bf722e9cfdeb7c4a6feab
x-lambda-id: afe6b9e7-9a9c-4bcd-aed0-ea42692a2144
x-wf-region: us-east-1
alt-svc: h3=":443"; ma=86400
content-encoding: gzip'
00:54:35.943 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 66, cap: 316), decoderResult: success)'
00:54:35.944 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 4390, cap: 8192), decoderResult: success)'
00:54:35.945 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3134, cap: 4096), decoderResult: success)'
00:54:35.945 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 4545, cap: 8192), decoderResult: success)'
00:54:35.945 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 7376, cap: 8192), decoderResult: success)'
00:54:35.945 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 8212, cap: 16384), decoderResult: success)'
00:54:35.947 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 8130, cap: 8192), decoderResult: success)'
00:54:35.947 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3308, cap: 4096), decoderResult: success)'
00:54:35.948 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 5603, cap: 8192), decoderResult: success)'
00:54:35.948 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 436, cap: 512), decoderResult: success)'
00:54:35.948 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 10110, cap: 16384), decoderResult: success)'
00:54:35.949 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 5741, cap: 8192), decoderResult: success)'
00:54:35.950 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 13900, cap: 16384), decoderResult: success)'
00:54:35.950 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 20054, cap: 32768), decoderResult: success)'
00:54:35.950 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 4092, cap: 4096), decoderResult: success)'
00:54:35.951 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 16768, cap: 32768), decoderResult: success)'
00:54:35.951 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 8341, cap: 16384), decoderResult: success)'
00:54:35.952 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3320, cap: 4096), decoderResult: success)'
00:54:35.952 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 5113, cap: 8192), decoderResult: success)'
00:54:35.952 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 5582, cap: 8192), decoderResult: success)'
00:54:35.953 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 7598, cap: 8192), decoderResult: success)'
00:54:35.953 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 9522, cap: 16384), decoderResult: success)'
00:54:35.954 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 11721, cap: 16384), decoderResult: success)'
00:54:35.954 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 6486, cap: 8192), decoderResult: success)'
00:54:35.955 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 21715, cap: 32768), decoderResult: success)'
00:54:35.955 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 23652, cap: 32768), decoderResult: success)'
00:54:35.955 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 23922, cap: 32768), decoderResult: success)'
00:54:35.956 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 14696, cap: 16384), decoderResult: success)'
00:54:35.956 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 4986, cap: 8192), decoderResult: success)'
00:54:35.956 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 19446, cap: 32768), decoderResult: success)'
00:54:35.957 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 10157, cap: 16384), decoderResult: success)'
00:54:35.957 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 10922, cap: 16384), decoderResult: success)'
00:54:35.958 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 6373, cap: 8192), decoderResult: success)'
00:54:35.958 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3680, cap: 4096), decoderResult: success)'
00:54:35.958 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3211, cap: 4096), decoderResult: success)'
00:54:35.958 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 10827, cap: 16384), decoderResult: success)'
00:54:35.959 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3502, cap: 4096), decoderResult: success)'
00:54:35.959 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 3853, cap: 4096), decoderResult: success)'
00:54:35.960 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 4282, cap: 8192), decoderResult: success)'
00:54:35.960 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpContent(data: PooledUnsafeHeapByteBuf(ridx: 0, widx: 1399, cap: 2048), decoderResult: success)'
00:54:35.961 [gatling-1-1] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='EmptyLastHttpContent'
00:54:35.963 [main] DEBUG io.gatling.http.engine.HttpEngine -- Warm up request https://gatling.io successful
00:54:35.964 [main] DEBUG io.gatling.http.engine.HttpEngine -- Warm up done
Simulation bci.cards.simulation.PublicJsonPlaceholderPostSmokeSimulation started...
00:54:35.991 [pool-1-thread-1] DEBUG io.gatling.core.controller.Controller -- Setting up max duration
00:54:35.993 [pool-1-thread-2] INFO io.gatling.core.stats.writer.ConsoleDataWriter -- Initializing
00:54:35.994 [pool-1-thread-3] INFO io.gatling.core.stats.writer.LogFileDataWriter -- Initializing
00:54:35.996 [pool-1-thread-2] INFO io.gatling.core.stats.writer.ConsoleDataWriter -- Initialized
00:54:36.002 [pool-1-thread-4] INFO io.gatling.core.controller.inject.open.OpenWorkload -- Scenario Mock público - JSONPlaceholder POST has finished injecting
00:54:36.003 [pool-1-thread-4] INFO io.gatling.core.controller.inject.Injector -- All scenarios have finished injecting
00:54:36.004 [gatling-1-2] DEBUG io.gatling.core.controller.inject.open.OpenWorkload -- Start user #1
00:54:36.015 [pool-1-thread-3] INFO io.gatling.core.stats.writer.LogFileDataWriter -- Initialized
00:54:36.024 [gatling-1-2] DEBUG io.gatling.http.engine.tx.HttpTxExecutor -- Sending request=POST simulado uri=https://jsonplaceholder.typicode.com/posts: scenario=Mock público - JSONPlaceholder POST, userId=1
00:54:36.027 [gatling-1-2] DEBUG io.gatling.http.client.pool.ChannelPool -- No channel in the pool for key ChannelPoolKey{clientId=1, remoteKey=RemoteKey{targetHostBaseUrl='https://jsonplaceholder.typicode.com', proxyHost='null', proxyPort=0}}
00:54:36.031 [gatling-1-2] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- Opening new channel to remote=[jsonplaceholder.typicode.com/172.67.167.151:443, jsonplaceholder.typicode.com/104.21.59.19:443, jsonplaceholder.typicode.com/[2606:4700:3037:0:0:0:ac43:a797]:443, jsonplaceholder.typicode.com/[2606:4700:3033:0:0:0:6815:3b13]:443] from local=null
00:54:36.089 [gatling-1-2] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- Connected to remoteAddress=jsonplaceholder.typicode.com/172.67.167.151:443 from localAddress=/172.23.0.2:42400
00:54:36.089 [gatling-1-2] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- Installing SslHandler for jsonplaceholder.typicode.com:443
00:54:36.151 [gatling-1-2] DEBUG io.netty.handler.ssl.util.InsecureTrustManagerFactory -- Accepting a server certificate: CN=typicode.com
00:54:36.151 [gatling-1-2] DEBUG io.gatling.http.client.impl.DefaultHttpClient -- TLS handshake successful: peerHost=jsonplaceholder.typicode.com peerPort=443 protocol=TLSv1.3 cipher suite=TLS_AES_128_GCM_SHA256
00:54:36.151 [gatling-1-2] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Write request WritableRequest{request=DefaultFullHttpRequest(decodeResult: success, version: HTTP/1.1, content: UnpooledHeapByteBuf(ridx: 0, widx: 63, cap: 63/63))
POST /posts HTTP/1.1
content-type: application/json
accept: application/json
user-agent: gatling-control-center-smoke/1.0
host: jsonplaceholder.typicode.com
content-length: 63, content=null}
00:54:36.152 [gatling-1-2] DEBUG io.netty.handler.ssl.SslHandler -- [id: 0xe15ec1ab, L:/172.23.0.2:42400 - R:jsonplaceholder.typicode.com/172.67.167.151:443] HANDSHAKEN: protocol:TLSv1.3 cipher suite:TLS_AES_128_GCM_SHA256
00:54:36.329 [gatling-1-2] DEBUG io.netty.handler.codec.compression.Zstd -- zstd-jni not in the classpath; Zstd support will be unavailable.
00:54:36.329 [gatling-1-2] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultHttpResponse(decodeResult: success, version: HTTP/1.1)
HTTP/1.1 201 Created
Date: Tue, 21 Jul 2026 00:54:36 GMT
Content-Type: application/json; charset=utf-8
Content-Length: 89
Connection: keep-alive
access-control-allow-credentials: true
access-control-expose-headers: Location
Cache-Control: no-cache
etag: W/"59-b5Eajz4NhqQtU616PC57soFsOlY"
expires: -1
location: https://jsonplaceholder.typicode.com/posts/101
nel: {"report_to":"heroku-nel","response_headers":["Via"],"max_age":3600,"success_fraction":0.01,"failure_fraction":0.1}
pragma: no-cache
report-to: {"group":"heroku-nel","endpoints":[{"url":"https://nel.heroku.com/reports?s=VP1Tt%2B5YghYgUlBRDfffNlfGEQhg%2FQBdGppUMDHrUo0%3D\u0026sid=e11707d5-02a7-43ef-b45e-2cf4d2036f7d\u0026ts=1784595276"}],"max_age":3600}
reporting-endpoints: heroku-nel="https://nel.heroku.com/reports?s=VP1Tt%2B5YghYgUlBRDfffNlfGEQhg%2FQBdGppUMDHrUo0%3D&sid=e11707d5-02a7-43ef-b45e-2cf4d2036f7d&ts=1784595276"
Server: cloudflare
vary: Origin, X-HTTP-Method-Override, Accept-Encoding
via: 2.0 heroku-router
x-content-type-options: nosniff
x-powered-by: Express
x-ratelimit-limit: 1000
x-ratelimit-remaining: 999
x-ratelimit-reset: 1784595311
cf-cache-status: DYNAMIC
CF-RAY: a1e63c3baebef24e-GRU
alt-svc: h3=":443"; ma=86400'
00:54:36.330 [gatling-1-2] DEBUG io.gatling.http.client.impl.HttpAppHandler -- Read msg='DefaultLastHttpContent(data: PooledSlicedByteBuf(ridx: 0, widx: 89, cap: 89/89, unwrapped: PooledUnsafeDirectByteBuf(ridx: 1322, widx: 1322, cap: 1344)), decoderResult: success)'
00:54:36.330 [gatling-1-2] DEBUG io.gatling.http.client.pool.ChannelPool -- Offering channel entry ChannelPoolKey{clientId=1, remoteKey=RemoteKey{targetHostBaseUrl='https://jsonplaceholder.typicode.com', proxyHost='null', proxyPort=0}} to pool
00:54:36.362 [gatling-1-2] DEBUG io.gatling.core.action.Exit -- End user #1
00:54:36.363 [pool-1-thread-8] DEBUG io.gatling.core.controller.inject.Injector -- End user #Mock público - JSONPlaceholder POST
00:54:36.364 [pool-1-thread-8] INFO io.gatling.core.controller.inject.Injector -- All users of scenario Mock público - JSONPlaceholder POST are stopped
00:54:36.364 [pool-1-thread-8] INFO io.gatling.core.controller.inject.Injector -- Stopping
00:54:36.365 [pool-1-thread-11] INFO io.gatling.core.controller.Controller -- Injector has stopped, initiating graceful stop

========================================================================================================================
2026-07-21 00:54:36 GMT                                                                               0s elapsed
---- Requests -----------------------------------------------------------------------|---Total---|-----OK----|----KO----
> Global                                                                             |         1 |         1 |         0
> POST simulado                                                                      |         1 |         1 |         0

---- Mock público - JSONPlaceholder POST -------------------------------------------------------------------------------
[###############################################################################################################]   100%
          waiting:         0 / active:         0  / done:         1
========================================================================================================================

00:54:36.378 [pool-1-thread-12] DEBUG io.gatling.core.controller.Controller -- StatsEngine was stopped
00:54:36.379 [main] INFO io.gatling.app.Runner -- Simulation bci.cards.simulation.PublicJsonPlaceholderPostSmokeSimulation completed in 0 seconds
00:54:36.384 [gatling-1-1] DEBUG io.netty.buffer.PoolThreadCache -- Freed 24 thread-local buffer(s) from thread: gatling-1-1
00:54:36.384 [gatling-1-2] DEBUG io.netty.buffer.PoolThreadCache -- Freed 12 thread-local buffer(s) from thread: gatling-1-2
Parsing log file(s)...
00:54:36.389 [main] INFO io.gatling.charts.stats.LogFileReader$ -- Collected /app/gatling-runner/build/reports/gatling/publicjsonplaceholderpostsmokesimulation-20260721005435701/simulation.log from publicjsonplaceholderpostsmokesimulation-20260721005435701
00:54:36.391 [main] INFO io.gatling.charts.stats.FirstPassParser -- First pass
00:54:36.394 [main] INFO io.gatling.charts.stats.FirstPassParser -- First pass done: read 5 records
00:54:36.399 [main] INFO io.gatling.charts.stats.SecondPassParser -- Second pass
00:54:36.411 [main] INFO io.gatling.charts.stats.SecondPassParser -- Second pass: read 5 records
Parsing log file(s) done in 0s.
Generating reports...

========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |         1 |         1 |         -
> min response time (ms)                                                             |       303 |       303 |         -
> max response time (ms)                                                             |       303 |       303 |         -
> mean response time (ms)                                                            |       303 |       303 |         -
> response time std deviation (ms)                                                   |         0 |         0 |         -
> response time 50th percentile (ms)                                                 |       303 |       303 |         -
> response time 75th percentile (ms)                                                 |       303 |       303 |         -
> response time 95th percentile (ms)                                                 |       303 |       303 |         -
> response time 99th percentile (ms)                                                 |       303 |       303 |         -
> mean throughput (rps)                                                              |         1 |         1 |         -
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                              1   (100%)
> OK: 800 ms <= t < 1200 ms                                                                                   0     (0%)
> OK: t >= 1200 ms                                                                                            0     (0%)
> KO                                                                                                          0     (0%)
========================================================================================================================

Reports generated, please open the following file: file:///app/gatling-runner/build/reports/gatling/publicjsonplaceholderpostsmokesimulation-20260721005435701/index.html
Global: count of failed events is 0.0 : true (actual : 0.0)
Global: max of response time is less than 10000.0 : true (actual : 303.0)

BUILD SUCCESSFUL in 24s
2 actionable tasks: 2 executed
[CONTROL] Reporte HTML agregado a results/gatling-report/index.html
[CONTROL] Estado final: SUCCEEDED